In [1]:
%matplotlib inline
import pandas as pd

In [2]:
title=pd.read_csv('titles.csv')
cast=pd.read_csv('cast.csv')
rel=pd.read_csv('release_dates.csv')
title.head(10)

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008
5            Tight Spot  1955
6        Chocolate (II)  2011
7      Wang de Shengyan  2012
8       Bao dao mei ren  1956
9   A Man Called Nereus  2012

In [3]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [4]:
print(title.shape)

(244914, 2)

In [5]:
title.isnull().sum()

title    0
year     0
dtype: int64

# How many movies are listed in the titles dataframe?

In [6]:
print("total no of movies under title column:", title['title'].count() )

total no of movies under title column: 244914

# What are the earliest two films listed in the titles dataframe?

In [7]:
title.nsmallest(2, ['year'])

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

# How many movies have the title "Hamlet"?

In [14]:
title[title["title"]== "Hamlet"]["title"].count()
print("the total no of movies with the name hamlet is: ", title[title["title"]== "Hamlet"]["title"].count())

the total no of movies with the name hamlet is:  20

# How many movies are titled "North by Northwest"?

In [16]:
print("the total no of movies with the name North by Northwest is: ", title[title["title"]== "North by Northwest"]["title"].count())

the total no of movies with the name North by Northwest is:  1

# When was the first movie titled "Hamlet" made?

In [21]:
pd=title.loc[title['title'].str.contains('Hamlet')]
print(pd)
pd.nsmallest(1, ['year'])

                                          title  year
6422                                     Hamlet  2017
10637                                    Hamlet  1921
39916                                    Hamlet  1913
46189                             Zombie Hamlet  2012
48703                        Han, hun og Hamlet  1922
48886                     Green Eggs and Hamlet  1995
50258             Hamlet: The Fall of a Sparrow  2018
51159                 Hamlet, Prince of Denmark  1997
52097                    Hamlet liikemaailmassa  1987
52521                                    Hamlet  1910
62000                                    Hamlet  2000
67406                                    Hamlet  1969
82130                                    Hamlet  1987
84606             National Theatre Live: Hamlet  2015
84840                                  Hamlet_X  2003
88065                                    Hamlet  2016
89209         Royal Shakespeare Company: Hamlet  2016
94411                               Hamlet (II)  2005
94884                        Han, hun og Hamlet  1932
98431   The Tragedy of Hamlet Prince of Denmark  2007
101728                                   Hamlet  1948
102779                           Hamlet Unbound  2012
104397                Hamlet: Prince of Denmark  1989
105669                           Hamlet's Ghost  2015
109416          Dogg's Hamlet, Cahoot's Macbeth  2005
122827                                   Hamlet  1973
128792                      Harry, Hamlet and I  2013
133921                                   Hamlet  1976
135751                              Hamlet (II)  2017
138162                 Hamlet, Son of a Kingpin  2015
148503      Predstava 'Hamleta' u Mrdusi Donjoj  1974
154029                                   Hamlet  2015
156655                           Kitchen Hamlet  2009
161324                                   Hamlet  1964
172640                                   Hamlet  1954
173033                                   Hamlet  2011
176125                              Hamlet (II)  1964
177050                                 Hamlet 2  2008
178222                                   Hamlet  1996
178529                              Hamlet (II)  2015
178829                            Hamlet A.D.D.  2014
182847                Hamlet in the Golden Vale  2017
189093                                   Hamlet  2009
190799                Hamlet the Vampire Slayer  2008
192142                                   Hamlet  1990
194338                     Hamlet Demonstration  2011
198234                                   Hamlet  1911
198793                                 Hamlet X  2004
199932                             Hamlet (III)  2007
200307                              Fuck Hamlet  1996
202025                                   Hamlet  2014
214820                       A Sagebrush Hamlet  1919
223833                             H for Hamlet  1993
236188                   Hamlet in the Hamptons  2002
239719              Intikam Melegi/Kadin Hamlet  1976
240540                           Hamlet/Horatio  2017
244624                              Hamlet (II)  2007

        title  year
52521  Hamlet  1910

# List all of the "Treasure Island" movies from earliest to most recent.

In [23]:
title.loc[title['title'].str.contains("Treasure Island")]

                                                    title  year
2830                           Pirates of Treasure Island  2006
26111                              Muppet Treasure Island  1996
27076                                     Treasure Island  1999
34288                           Five on a Treasure Island  1957
34341                           Return to Treasure Island  1954
37238                                     Treasure Island  1973
55686                                     Treasure Island  1918
64173                       The Secret of Treasure Island  1938
65051                                     Treasure Island  1972
77354                                     Treasure Island  1950
79701                     Charlie Chan at Treasure Island  1939
112591  Treasure Island Kids: The Mystery of Treasure ...  2006
141822                                    Treasure Island  1934
155317             National Theatre Live: Treasure Island  2015
173051                                    Treasure Island  1985
196514                                    Treasure Island  1920
209707  Treasure Island Kids: The Battle of Treasure I...  2006
216970                               Treasure Island (II)  1999
244541  Treasure Island Kids: The Monster of Treasure ...  2006

# How many movies were made in the year 1950?

In [27]:
title[title["year"]== 1950]["title"].count()

1113

# How many movies were made in the year 1960?

In [28]:
title[title["year"]== 1960]["title"].count()

1549

# In what years has a movie titled "Batman" been released?

In [45]:
pd2=title.loc[title['title'].str.contains("Batman")]
pd2.nsmallest(1, ['year'])

        title  year
39349  Batman  1943

# How many roles were there in the movie "Inception"?

In [51]:
cast[cast["title"]== "Inception"]["n"].shape

(78,)

# How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [52]:
cast[cast["title"]== "Inception"]["n"].isnull().sum()

27

# But how many roles in the movie "Inception" did receive an "n" value?

In [54]:
cast[cast["title"]== "Inception"]["n"].notnull().sum()

51

# Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [61]:
pd4 = cast[cast["title"]== "North by Northwest"].sort_values('n',ascending=True)
pd4.dropna(inplace=True)
print ("Cast who got ranked in ascending order are :\n",pd4.name)

Cast who got ranked in ascending order are :
 871426               Cary Grant
3518333         Eva Marie Saint
1457165             James Mason
3157232     Jessie Royce Landis
356707           Leo G. Carroll
3048272    Josephine Hutchinson
1695173             Philip Ober
1275337           Martin Landau
2447081           Adam Williams
1811387            Edward Platt
665768        Robert Ellenstein
2295714            Les Tremayne
464736          Philip Coolidge
1508344           Patrick McVey
206471             Edward Binns
1384780               Ken Lynch
Name: name, dtype: object

# Display the entire cast, in "n"-order, of the 1972 film "Sleuth"

In [63]:
pd5= cast[cast["title"]== "Sleuth"].sort_values('n',ascending=True)
pd5[pd5["year"]==1972].name

1705394      Laurence Olivier
326773          Michael Caine
373876         Alec Cawthorne
1465483    John (II) Matthews
2724553    Eve (III) Channing
1448690          Teddy Martin
Name: name, dtype: object

# How many roles were credited in the silent 1921 version of Hamlet?

In [65]:
pd6 = cast[cast["title"]== "Hamlet"].sort_values('n',ascending=True)
pd6[pd6["year"]==1921].name.count()

9

# How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [66]:
pd6[pd6["year"]==1996].name.count()

54

# How many "Hamlet" roles have been listed in all film credits through history?

In [70]:
len(pd6.name.unique())

312

# How many people have played an "Ophelia"?

In [72]:
len(cast[cast["character"]== "Ophelia"]["name"].unique())

115

# How many people have played a role called "The Dude"?

In [73]:
len(cast[cast["character"]== "The Dude"]["name"].unique())

19

# How many people have played a role called "The Stranger"?

In [74]:
len(cast[cast["name"]== "Judi Dench"]["character"].unique())

46

# How many roles has Sidney Poitier played throughout his career?

In [75]:
len(cast[cast["name"]== "Sidney Poitier"]["character"].unique())

41

# How many roles has Judi Dench played?

In [76]:
len(cast[cast["name"]== "Judi Dench"]["character"].unique())

46

# List the leading roles that Cary Grant played in the 1940s in order by year.

215471

# How many roles were available for actors in the 1950s?

In [83]:
cast.loc[cast['title'].str.contains('Cary Grant')]

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

# How many roles were available for actresses in the 1950s?

In [85]:
len(cast[(cast["year"] > 1949) & 
     (cast["year"] < 1960) & (cast["type"] == "actress" )].n)

57733

# How many leading roles (n=1) were available from the beginning of film history through 1980?

In [87]:
cast[(cast["year"] < 1980)&(cast["n"] == 1.0)].sort_values('year',ascending=True).n.count()

63957

# How many non-leading roles were available through from the beginning of film history through 1980?

In [89]:
cast[(cast["year"] < 1980)&(cast["n"] != 1.0)].sort_values('year',ascending=True).n.count()

651497

# How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [90]:
cast[(cast["year"] < 1980)].n.isnull().sum()

443881